tap "cybozu/assam"
tap "homebrew/bundle"
tap "sanemat/font"

brew "awscli"
brew "bat"
brew "btop"
brew "ctop"
brew "docker"
brew "docker-compose"
brew "elixir"
brew "fd"
brew "fontforge"
brew "font-hack-nerd-font"
brew "fzf"
brew "gdk-pixbuf"
brew "ghostscript"
brew "git"
brew "glib"
brew "go"
brew "gobject-introspection"
brew "gping"
brew "graphviz"
brew "harfbuzz"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "libheif"
brew "libpq"
brew "librsvg"
brew "libtool"
brew "lsd"
brew "mecab"
brew "mecab-ipadic"
brew "mysql"
brew "node", link: false
brew "pango"
brew "postgresql@13"
brew "postgresql@14"
brew "python@3.8"
brew "python@3.9"
brew "rbenv"
brew "ripgrep"
brew "ruby"
brew "rustup-init"
brew "sanemat/font/ricty"
brew "stow"
brew "telnet"
brew "wireshark"
brew "yarn"
brew "yazi"
brew "zsh-completions"

cask "clipy"
cask "deepl"
cask "github"
cask "google-chrome"
cask "google-japanese-ime"
cask "graphiql"
cask "iterm2"
cask "monitorcontrol"
cask "obsidian"
cask "postman"
cask "raycast"
cask "slack"
cask "stats"
cask "tableplus"
cask "timche-gmail-desktop"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "zoom"

vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "chun.vscode-translate"
vscode "coenraads.bracket-pair-colorizer"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "funkyremi.vscode-google-translate"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "groksrc.ruby"
vscode "intellsmi.comment-translate"
vscode "johnpapa.vscode-peacock"
vscode "kaiwood.endwise"
vscode "misogi.ruby-rubocop"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "naumovs.color-highlight"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "yzane.markdown-pdf"
vscode "zignd.html-css-class-completion"
